# 라이브러리 선언

In [1]:
import pandas as pd
import numpy as np

In [2]:
selloutData = pd.read_csv("../dataset/kopo_channel_seasonality_new.csv")

In [3]:
customerData = pd.read_csv("../dataset/customerdata.csv")

# 1. 데이터 조작하기

#### 1-1. 분석 할 데이터의 칼럼 조회하는 방법

In [4]:
selloutData[["REGIONID","PRODUCT"]].head(3)

  REGIONID    PRODUCT
0      A60   PRODUCT4
1      A60  PRODUCT59
2      A60  PRODUCT34

#### 1-2. 데이터프레임 생성(데이터를 새로운 변수에 저장하기)

In [5]:
selloutData2 = pd.DataFrame(selloutData)
selloutData2.head(3)

  REGIONID    PRODUCT  YEARWEEK      QTY
0      A60   PRODUCT4    201402     71.0
1      A60  PRODUCT59    201402  22275.0
2      A60  PRODUCT34    201402   4463.0

#### 1-3. 데이터를 조건을 설정하여 조회하기 ( ※ inplace 적용이 안되기 때문에 조회를 한 후 변수에 대입하여야한다.)

In [6]:
condition1 = customerData[(customerData.EMI==3) & (customerData.DEVICECOUNT>5)]
condition1.head(3)

    CUSTID  AVERAGEPRICE  EMI  DEVICECOUNT  PRODUCTAGE          CUSTTYPE
0   A13566   4273.900000    3          6.4    1.679181  Big-Screen-lover
27  F17131   3179.708359    3          6.5    1.100000        Early-bird
33  G16437   3787.328898    3          6.7    1.000000        Early-bird

In [7]:
condition2 = customerData.query('EMI == 3 & DEVICECOUNT > 5')
condition2.head(3)

    CUSTID  AVERAGEPRICE  EMI  DEVICECOUNT  PRODUCTAGE          CUSTTYPE
0   A13566   4273.900000    3          6.4    1.679181  Big-Screen-lover
27  F17131   3179.708359    3          6.5    1.100000        Early-bird
33  G16437   3787.328898    3          6.7    1.000000        Early-bird

#### 1-4. 데이터프레임 타입변환

##### - 데이터프레임 칼럼의 자료형을 확인할 때 : (data file name).dtypes

In [8]:
customerData.dtypes

CUSTID           object
AVERAGEPRICE    float64
EMI               int64
DEVICECOUNT     float64
PRODUCTAGE      float64
CUSTTYPE         object
dtype: object

##### - 데이터프레임의 자료형 변환

In [9]:
customerData["DEVICECOUNT"] = customerData["DEVICECOUNT"].astype(float)

In [10]:
customerData.dtypes  #object타입은 string타입을 의미한다

CUSTID           object
AVERAGEPRICE    float64
EMI               int64
DEVICECOUNT     float64
PRODUCTAGE      float64
CUSTTYPE         object
dtype: object

### 실습 문제 1

#### 문제 1-1. kopo_customerdata 데이터에서 gender == male 이면서 email > 0 인 데이터를 추출하시오

##### - 데이터프레임에 데이터 저장

In [11]:
kopo_customerData = pd.read_csv("../dataset/kopo_customerdata.csv")
kopo_customerData.head()

,CUSTOMERCODE,STATENAME,ST,GENDER,DOB,GENDER1,EMAIL,FEST_CNT,TOTAL_AMOUNT,AC_AMOUNT,AV_AMOUNT,HA_AMOUNT,EMI_CE_AMOUNT,IS_HIGHEND,CNT_VIST,GAP_VISIT
0,1503989,State2,2,Male,0,1,1,0,30300,0,30300,0,0,0,1,0
1,1190338,State2,2,Male,0,1,0,1,46500,0,46500,0,0,0,1,0
2,1424715,State2,2,Female,0,2,0,0,22700,0,0,22700,0,0,1,0
3,2483305,State2,2,Male,0,1,0,1,31400,0,31400,0,0,0,1,0
4,1178802,State2,2,Male,0,1,0,1,44900,0,0,44900,0,0,1,0

##### - 추출한 데이터 중 필요한 데이터를 정제

In [12]:
kopo_customerData["GENDER"] = kopo_customerData.GENDER.astype("str")

In [13]:
kopo_customerData = kopo_customerData[(kopo_customerData.GENDER.str[0:4] == "Male") & \
                                (kopo_customerData.EMAIL > 0)]

In [14]:
kopo_customerData.head(3)

,CUSTOMERCODE,STATENAME,ST,GENDER,DOB,GENDER1,EMAIL,FEST_CNT,TOTAL_AMOUNT,AC_AMOUNT,AV_AMOUNT,HA_AMOUNT,EMI_CE_AMOUNT,IS_HIGHEND,CNT_VIST,GAP_VISIT
0,1503989,State2,2,Male,0,1,1,0,30300,0,30300,0,0,0,1,0
16,1154228,State2,2,Male,0,1,1,0,18200,0,0,18200,0,0,1,0
81,393246,State2,2,Male,0,1,1,1,18200,0,0,18200,0,0,1,0

#### 문제 1-2. kopo_product_volume 데이터에서 PRODUCTGROUP == ST0002 이면서 VOLUME > 300000 데이터를 추출하시오

##### -데이터프레임에 데이터 저장

In [15]:
kopo_product_volume_data = pd.read_csv("../dataset/kopo_product_volume.csv")
kopo_product_volume_data.head(3)

  REGIONID PRODUCTGROUP  YEARWEEK  VOLUME
0      A01       ST0001    201415  810144
1      A01       ST0002    201415  128999
2      A01       ST0001    201418  671464

##### - 추출한 데이터 중 필요한 데이터를 정제

In [16]:
kopo_product_volume_data = kopo_product_volume_data[(kopo_product_volume_data.PRODUCTGROUP == "ST0002") & \
                                                     (kopo_product_volume_data.VOLUME > 300000)]

In [17]:
kopo_product_volume_data.head(5)

    REGIONID PRODUCTGROUP  YEARWEEK   VOLUME
80       A01       ST0002    201452   422468
86       A01       ST0002    201451   356271
90       A01       ST0002    201449   669711
94       A01       ST0002    201447   378339
102      A01       ST0002    201448  1400339

### 실습문제 2

#### 문제 2-1. [데이터타입 통합] kopo_channel_seasonality_new.csv 자료에서 QTY컬럼 -> 실수(float), 이외컬럼 ->문자(str)로 변경하시오

##### - 위에서 불러왔던 데이터 사용, 출력하여 컬럼 확인

In [18]:
selloutData.head(0)

Empty DataFrame
Columns: [REGIONID, PRODUCT, YEARWEEK, QTY]
Index: []

In [19]:
selloutData.dtypes

REGIONID     object
PRODUCT      object
YEARWEEK      int64
QTY         float64
dtype: object

In [20]:
selloutData["REGIONID"] = selloutData["REGIONID"].astype(str)
selloutData["PRODUCT"] = selloutData["PRODUCT"].astype(str)
selloutData["YEARWEEK"] = selloutData["YEARWEEK"].astype(str)
selloutData["QTY"] = selloutData["QTY"].astype(float)

In [21]:
selloutData.dtypes

REGIONID     object
PRODUCT      object
YEARWEEK     object
QTY         float64
dtype: object

#### 2-1. 원하는 컬럼 조회하기

In [22]:
# how to?
# 데이터 프레임명 [['컬럼명1','컬럼명2']]
# 데이터 프레임명.filter(items=['컬럼명1','컬럼명2'])

In [23]:
customerData.head(0)

Empty DataFrame
Columns: [CUSTID, AVERAGEPRICE, EMI, DEVICECOUNT, PRODUCTAGE, CUSTTYPE]
Index: []

##### - 데이터프레임 리스트 활용하기

In [24]:
customerData_ColumnTest = customerData[['CUSTID','EMI']]
customerData_ColumnTest.head(3)

   CUSTID  EMI
0  A13566    3
1  A14219    2
2  A15312    2

##### - filter 함수 활용하기

In [25]:
customerData_ColumnTest2 = customerData.filter(items=['CUSTID','EMI'])
customerData_ColumnTest2.head(3)

   CUSTID  EMI
0  A13566    3
1  A14219    2
2  A15312    2

### 실습문제 3

#### 문제 3-1. kopo_customerdata 테이블에서 customercode, statename, gender, total_amount 컬럼만 추출하세요

##### - 데이터를 로드하여 컬럼 확인

In [26]:
kopo_customerData.head(0)

Empty DataFrame
Columns: [CUSTOMERCODE, STATENAME, ST, GENDER, DOB, GENDER1, EMAIL, FEST_CNT, TOTAL_AMOUNT, AC_AMOUNT, AV_AMOUNT, HA_AMOUNT, EMI_CE_AMOUNT, IS_HIGHEND, CNT_VIST, GAP_VISIT]
Index: []

##### - 원하는 컬럼 재정의하여 데이터프레임으로 추출

In [27]:
kopo_customerData_NeedColumn = kopo_customerData[["CUSTOMERCODE","STATENAME","GENDER","TOTAL_AMOUNT"]]

In [28]:
kopo_customerData_NeedColumn.head(3)

    CUSTOMERCODE STATENAME GENDER  TOTAL_AMOUNT
0        1503989    State2   Male         30300
16       1154228    State2   Male         18200
81        393246    State2   Male         18200

#### 3-1. 인덱스를 활용하여 조회하기 (iloc)

In [29]:
# how to?
# 데이터프레임명.iloc[ : , : ]
# 콤마(,)를 기준으로 앞은 행 인덱스 뒤는 열인덱스 ( : ) 만 활용 시 전체
# [n1:n2]는 n1부터 n2까지
# [n1,n2]는 n1과 n2만

In [30]:
dfc1 = customerData.iloc[0:1,:]
dfc1

   CUSTID  AVERAGEPRICE  EMI  DEVICECOUNT  PRODUCTAGE          CUSTTYPE
0  A13566        4273.9    3          6.4    1.679181  Big-Screen-lover

### 실습문제 4

#### 문제 4-1. kopo_customerdata 테이블에서 0~5 번째 행의 statename, gender를 선택하세요(인덱스 활용)

In [31]:
kopo_customerData.head(10)

,CUSTOMERCODE,STATENAME,ST,GENDER,DOB,GENDER1,EMAIL,FEST_CNT,TOTAL_AMOUNT,AC_AMOUNT,AV_AMOUNT,HA_AMOUNT,EMI_CE_AMOUNT,IS_HIGHEND,CNT_VIST,GAP_VISIT
0,1503989,State2,2,Male,0,1,1,0,30300,0,30300,0,0,0,1,0
16,1154228,State2,2,Male,0,1,1,0,18200,0,0,18200,0,0,1,0
81,393246,State2,2,Male,0,1,1,1,18200,0,0,18200,0,0,1,0
206,2532568,State2,2,Male,1,1,1,0,48000,48000,0,0,0,0,1,0
216,487928,State2,2,Male,0,1,1,0,72300,0,27900,44400,0,0,1,0
226,2452240,State2,2,Male,1,1,1,1,22500,0,0,22500,0,0,1,0
299,1295854,State2,2,Male,1,1,1,2,59900,0,25100,34800,0,0,4,655
308,554757,State2,2,Male,0,1,1,0,22100,0,0,22100,0,0,1,0
330,761018,State2,2,Male,1,1,1,0,21200,0,0,21200,0,0,1,0
367,2191152,State2,2,Male,0,1,1,1,55700,0,55700,0,0,0,1,0

In [32]:
kopo_customerData_indexTest = kopo_customerData.iloc[0:5,[1,3]]
kopo_customerData_indexTest

    STATENAME GENDER
0      State2   Male
16     State2   Male
81     State2   Male
206    State2   Male
216    State2   Male

#### 3-2. 인덱스를 활용하여 조회하기 (loc)

In [33]:
# how to?
# 데이터프레임명.loc[:,["COLUMNS","COLUMNS"]]
# 앞에는 행 인덱스 뒤에는 열의 STRING 이름을 입력
# 열은 범위로 지정이 불가하고 ,로 구분하여 지정해주어야함

In [34]:
customerData.head(0)

Empty DataFrame
Columns: [CUSTID, AVERAGEPRICE, EMI, DEVICECOUNT, PRODUCTAGE, CUSTTYPE]
Index: []

In [35]:
dfc2 = customerData.loc[0:2,["CUSTID","AVERAGEPRICE","DEVICECOUNT"]]
dfc2

   CUSTID  AVERAGEPRICE  DEVICECOUNT
0  A13566   4273.900000          6.4
1  A14219   3642.441950          4.0
2  A15312   3653.884565          5.0

#### 4-1. 이상 데이터 정제하기

In [36]:
# how to?
# 데이터프레임명['컬럼명'] = np.where(조건식, 조건식에 충족한다면 들어갈 값, 충족하지 않는다면 들어갈 값)

In [37]:
customerData["PRODUCTAGE_NEW"] = np.where(customerData["PRODUCTAGE"]<1,1,customerData["PRODUCTAGE"])
customerData.head(3)

,CUSTID,AVERAGEPRICE,EMI,DEVICECOUNT,PRODUCTAGE,CUSTTYPE,PRODUCTAGE_NEW
0,A13566,4273.900000,3,6.4,1.679181,Big-Screen-lover,1.679181
1,A14219,3642.441950,2,4.0,2.682023,Sleeping-dog,2.682023
2,A15312,3653.884565,2,5.0,3.208202,Sleeping-dog,3.208202

### 실습문제 5

#### 문제 5-1. PRODUCTAGE가 1보다 작으면 1, 2보다 작으면 2, 3보다 작으면 3, 이외는 5라고 새로운 컬럼 PRODUCT_AGE_NEW를 생성하시오

In [38]:
customerData["PRODUCTAGE_NEW"] = np.where(customerData["PRODUCTAGE"]<1,1,\
                                         np.where(customerData["PRODUCTAGE"]<2,2,\
                                                  np.where(customerData["PRODUCTAGE"]<3,3,\
                                                          5)))
customerData.head()

,CUSTID,AVERAGEPRICE,EMI,DEVICECOUNT,PRODUCTAGE,CUSTTYPE,PRODUCTAGE_NEW
0,A13566,4273.900000,3,6.4,1.679181,Big-Screen-lover,2
1,A14219,3642.441950,2,4.0,2.682023,Sleeping-dog,3
2,A15312,3653.884565,2,5.0,3.208202,Sleeping-dog,5
3,A16605,3713.211107,2,6.6,0.900000,Early-bird,1
4,B10634,3391.074215,2,4.2,2.453656,Sleeping-dog,3

### 실습문제 6

#### 문제 6-1. [불량 데이터 처리] kopo_channel_seasonality_new.csv 자료에서 QTY 마이너스 값을 0으로 변경한 자료를 QRY_NEW 컬럼에 생성하세요

In [39]:
selloutData["QTY_NEW"] = np.where(selloutData["QTY"]<0,0,selloutData["QTY"])

In [40]:
len(selloutData)

124658

#### 문제 6-2.[불량 데이터 처리] kopo_channel_seasonality_new.csv 자료에서 QTY 마이너스 값을 0으로 변경한 자료를 QTY_NEW 컬럼에 생성하시오

In [41]:
selloutData["YEAR"] = selloutData.YEARWEEK.astype(str).str[0:4]
selloutData.head(1)

  REGIONID   PRODUCT YEARWEEK   QTY  QTY_NEW  YEAR
0      A60  PRODUCT4   201402  71.0     71.0  2014

In [42]:
selloutData["WEEK"] = selloutData.YEARWEEK.astype(str).str[4:]
selloutData.head(1)

  REGIONID   PRODUCT YEARWEEK   QTY  QTY_NEW  YEAR WEEK
0      A60  PRODUCT4   201402  71.0     71.0  2014   02

In [43]:
refineSelloutData = selloutData[selloutData.WEEK.astype(int) <= 52]
refineSelloutData.head()

  REGIONID    PRODUCT YEARWEEK      QTY  QTY_NEW  YEAR WEEK
0      A60   PRODUCT4   201402     71.0     71.0  2014   02
1      A60  PRODUCT59   201402  22275.0  22275.0  2014   02
2      A60  PRODUCT34   201402   4463.0   4463.0  2014   02
3      A60  PRODUCT47   201402      0.0      0.0  2014   02
4      A60  PRODUCT56   201402     23.0     23.0  2014   02

In [44]:
len(refineSelloutData)

123864

#### 4-2. 이상 데이터 정제하기

In [45]:
# 함수 활용하여 이상 데이터 정제

In [46]:
def refining(df):
    if df['PRODUCTAGE']<1:
        return 1
    elif df['PRODUCTAGE']<2:
        return 2
    elif df['PRODUCTAGE']<3:
        return 3
    else:
        return 5

customerData["PRODUCTAGE_NEW2"] = customerData.apply(refining, axis=1)

In [47]:
customerData.head()

,CUSTID,AVERAGEPRICE,EMI,DEVICECOUNT,PRODUCTAGE,CUSTTYPE,PRODUCTAGE_NEW,PRODUCTAGE_NEW2
0,A13566,4273.900000,3,6.4,1.679181,Big-Screen-lover,2,2
1,A14219,3642.441950,2,4.0,2.682023,Sleeping-dog,3,3
2,A15312,3653.884565,2,5.0,3.208202,Sleeping-dog,5,5
3,A16605,3713.211107,2,6.6,0.900000,Early-bird,1,1
4,B10634,3391.074215,2,4.2,2.453656,Sleeping-dog,3,3

#### 5-1. 데이터 정렬하기

In [48]:
# how to?
# 데이터프레임명.sort_values(['컬럼1','컬럼2'],ascending = [True,False], inplace = True)

In [49]:
customerData.sort_values(["CUSTID","AVERAGEPRICE"],ascending = [True,False], inplace = True)
customerData.head()

,CUSTID,AVERAGEPRICE,EMI,DEVICECOUNT,PRODUCTAGE,CUSTTYPE,PRODUCTAGE_NEW,PRODUCTAGE_NEW2
0,A13566,4273.900000,3,6.4,1.679181,Big-Screen-lover,2,2
1,A14219,3642.441950,2,4.0,2.682023,Sleeping-dog,3,3
2,A15312,3653.884565,2,5.0,3.208202,Sleeping-dog,5,5
3,A16605,3713.211107,2,6.6,0.900000,Early-bird,1,1
4,B10634,3391.074215,2,4.2,2.453656,Sleeping-dog,3,3

In [50]:
# 기존 인덱스를 drop하고 새로운 인덱스를 생성
customerData = customerData.reset_index(drop=True)

In [51]:
sortkey = ["REGIONID","PRODUCT","YEARWEEK"]

In [52]:
sortedData = refineSelloutData.sort_values(sortkey)
sortedData.head()

     REGIONID    PRODUCT YEARWEEK    QTY  QTY_NEW  YEAR WEEK
298       A00  PRODUCT34   201401  661.0    661.0  2014   01
1757      A00  PRODUCT34   201402  679.0    679.0  2014   02
3125      A00  PRODUCT34   201403  578.0    578.0  2014   03
205       A00  PRODUCT34   201404  532.0    532.0  2014   04
4369      A00  PRODUCT34   201405  516.0    516.0  2014   05

In [53]:
# 기존 인덱스를 drop하고 새로운 인덱스를 생성
sortedData = sortedData.reset_index(drop=True)

#### 6-1. 데이터 요약분석하기

In [54]:
# how to?
# 데이터프레임명.groupby(['그룹 컬럼명']).집계함수

In [55]:
# 평균 구하기
# man(), min() 등 집계함수 사용 가능
# 특정 컬럼에 대해서만 groupkey 적용 시 [[컬럼명]] 기입
# groupby 함수는 종료 후 reset_index()를 통해 인덱스를 초기화시켜주는것이 좋음(인덱스가 섞이기때문에)

meanValue = customerData.groupby(["CUSTTYPE","EMI"], as_index = True).mean()
meanValue

                      AVERAGEPRICE  DEVICECOUNT  PRODUCTAGE  PRODUCTAGE_NEW  \
CUSTTYPE         EMI
Big-Screen-lover 1     3246.000000     5.000000    1.891624        2.000000
                 2     3535.317391     5.508696    2.223247        2.804348
                 3     4111.600000     6.400000    1.838520        2.333333
Early-bird       1     2390.083736     6.300000    1.000000        2.000000
                 2     3232.445885     6.460606    0.936364        1.242424
                 3     3455.966035     6.475000    0.962500        1.437500
Sleeping-dog     1     3185.918464     3.833333    2.357587        2.777778
                 2     3504.298670     4.353659    2.724274        3.463415

                      PRODUCTAGE_NEW2
CUSTTYPE         EMI
Big-Screen-lover 1           2.000000
                 2           2.804348
                 3           2.333333
Early-bird       1           2.000000
                 2           1.242424
                 3           1.437500
Sleeping-dog     1           2.777778
                 2           3.463415

In [56]:
maxValue = sortedData.groupby(["QTY","REGIONID"]).max()
maxValue.head()

                  PRODUCT YEARWEEK  QTY_NEW  YEAR WEEK
QTY    REGIONID
-364.0 A01       PRODUCT6   201611      0.0  2016   11
-343.0 A48       PRODUCT3   201652      0.0  2016   52
-252.0 A01       PRODUCT6   201612      0.0  2016   12
-245.0 A15       PRODUCT6   201644      0.0  2016   44
-113.0 A01       PRODUCT6   201552      0.0  2015   52

#### 6-2. 데이터 요약분석하기(심화 - 다중 집계)

In [57]:
# how to?
# 데이터프레임명.groupby(['그룹 컬럼명']).agg(['mean','std'])["구분하고자 하는 대상 컬럼"]

In [58]:
# 한가지 집계함수를 구하는 방식
# 한가지 집계함수에 대해서 구할때는 구하고자 하는 대상 컬럼을 두개의 대괄호로 묶어야하고 두가지 이상 일때는 한개의 대괄호로 묶어야함
groupData = sortedData.groupby(["REGIONID","PRODUCT"]).mean()[["QTY_NEW"]]
groupData.head()

                          QTY_NEW
REGIONID PRODUCT
A00      PRODUCT34     133.057692
         PRODUCT58     105.250000
         PRODUCT59   35957.570513
A01      PRODUCT1     5712.775641
         PRODUCT12  196825.403846

### 실습문제 7

#### 문제 7-1. customerdata의 EMI별 전체 칼럼들의 MAX 값을 구하시오

In [59]:
maxValue2 = customerData.groupby(["EMI"]).max()
maxValue2

,CUSTID,AVERAGEPRICE,DEVICECOUNT,PRODUCTAGE,CUSTTYPE,PRODUCTAGE_NEW,PRODUCTAGE_NEW2
EMI,,,,,,,
1,Y12458,3419.462596,6.3,2.994395,Sleeping-dog,3,3
2,Z19835,4166.533130,6.9,3.483573,Sleeping-dog,5,5
3,Z13534,4296.873743,6.9,2.055707,Early-bird,3,3

#### 문제 7-2. selloutData를 지역, 상품, 연주차 단위로 정렬하여 sortedData 변수에 담으시오

In [60]:
sortedData = selloutData.sort_values(["REGIONID","PRODUCT","YEARWEEK"])
sortedData.head()

     REGIONID    PRODUCT YEARWEEK    QTY  QTY_NEW  YEAR WEEK
298       A00  PRODUCT34   201401  661.0    661.0  2014   01
1757      A00  PRODUCT34   201402  679.0    679.0  2014   02
3125      A00  PRODUCT34   201403  578.0    578.0  2014   03
205       A00  PRODUCT34   201404  532.0    532.0  2014   04
4369      A00  PRODUCT34   201405  516.0    516.0  2014   05

#### 문제 7-3.sortedData 에서 지역, 상품 단위 판매령의 평균 및 표준편차 연산 후 groupData에담고,이후 컬럼명을 QTY_MEAN, QTY_STD로 변경하시오

In [61]:
groupData = sortedData.groupby(["REGIONID","PRODUCT"]).agg(["mean","std"])["QTY_NEW"]
groupData.head()

                             mean            std
REGIONID PRODUCT
A00      PRODUCT34     132.445860     154.867743
         PRODUCT58     105.235669     273.435108
         PRODUCT59   36086.547771   15192.174914
A01      PRODUCT1     5716.726115    3704.948589
         PRODUCT12  197052.777070  198866.717131

In [62]:
# 그룹바이로 묶여있는 상태를 풀어주기 위해 리셋인덱스를 해줌

In [63]:
groupData = groupData.reset_index()

In [64]:
groupData.columns = ["REGIONID","PRODUCT","QTY_MEAN","QTY_STD"]
groupData.head()

  REGIONID    PRODUCT       QTY_MEAN        QTY_STD
0      A00  PRODUCT34     132.445860     154.867743
1      A00  PRODUCT58     105.235669     273.435108
2      A00  PRODUCT59   36086.547771   15192.174914
3      A01   PRODUCT1    5716.726115    3704.948589
4      A01  PRODUCT12  197052.777070  198866.717131

### 6-3. 데이터 요약분석하기 (기본통계치 구하기)

In [65]:
# how to?
# 데이터프레임명.groupby(["컬럼명"]).describe()

In [66]:
stdValue = customerData.groupby(["CUSTTYPE","EMI"]).describe()
stdValue.head()

                     AVERAGEPRICE                                        \
                            count         mean         std          min
CUSTTYPE         EMI
Big-Screen-lover 1            1.0  3246.000000         NaN  3246.000000
                 2           46.0  3535.317391  322.633901  2650.900000
                 3            3.0  4111.600000  195.060324  3895.200000
Early-bird       1            1.0  2390.083736         NaN  2390.083736
                 2           33.0  3232.445885  345.810935  2411.008838

                                                                          \
                              25%          50%          75%          max
CUSTTYPE         EMI
Big-Screen-lover 1    3246.000000  3246.000000  3246.000000  3246.000000
                 2    3367.725000  3489.450000  3719.375000  4165.700000
                 3    4030.450000  4165.700000  4219.800000  4273.900000
Early-bird       1    2390.083736  2390.083736  2390.083736  2390.083736
                 2    2991.014703  3256.152962  3436.456382  4020.245162

                     DEVICECOUNT           ...  PRODUCTAGE_NEW       \
                           count      mean ...             75%  max
CUSTTYPE         EMI                       ...
Big-Screen-lover 1           1.0  5.000000 ...             2.0  2.0
                 2          46.0  5.508696 ...             3.0  5.0
                 3           3.0  6.400000 ...             2.5  3.0
Early-bird       1           1.0  6.300000 ...             2.0  2.0
                 2          33.0  6.460606 ...             1.0  2.0

                     PRODUCTAGE_NEW2                                          \
                               count      mean       std  min  25%  50%  75%
CUSTTYPE         EMI
Big-Screen-lover 1               1.0  2.000000       NaN  2.0  2.0  2.0  2.0
                 2              46.0  2.804348  0.653863  2.0  2.0  3.0  3.0
                 3               3.0  2.333333  0.577350  2.0  2.0  2.0  2.5
Early-bird       1               1.0  2.000000       NaN  2.0  2.0  2.0  2.0
                 2              33.0  1.242424  0.435194  1.0  1.0  1.0  1.0


                      max
CUSTTYPE         EMI
Big-Screen-lover 1    2.0
                 2    5.0
                 3    3.0
Early-bird       1    2.0
                 2    2.0

[5 rows x 40 columns]

### 7-1. 데이터 연산하기 (심화-고급)

In [67]:
# how to?
# 데이터프레임명.rolling(window = 5, center = False).mean()

In [68]:
# 이동평균 구간 정의
order = 5
import math
suborder = math.floor(order/2)
suborder

2

In [69]:
# 연산
customerData["TEST"] = customerData["PRODUCTAGE"].rolling(window = 5, center = False).mean()
customerData.head(10)

,CUSTID,AVERAGEPRICE,EMI,DEVICECOUNT,PRODUCTAGE,CUSTTYPE,PRODUCTAGE_NEW,PRODUCTAGE_NEW2,TEST
0,A13566,4273.900000,3,6.4,1.679181,Big-Screen-lover,2,2,NaN
1,A14219,3642.441950,2,4.0,2.682023,Sleeping-dog,3,3,NaN
2,A15312,3653.884565,2,5.0,3.208202,Sleeping-dog,5,5,NaN
3,A16605,3713.211107,2,6.6,0.900000,Early-bird,1,1,NaN
4,B10634,3391.074215,2,4.2,2.453656,Sleeping-dog,3,3,2.184612
5,B16849,3755.263391,2,4.7,2.786665,Sleeping-dog,3,3,2.406109
6,B18816,3213.911446,2,6.4,0.900000,Early-bird,1,1,2.049705
7,C10639,3516.500000,2,5.2,2.564830,Big-Screen-lover,3,3,1.921030
8,C12717,3732.900000,2,5.7,2.069995,Big-Screen-lover,3,3,2.155029
9,C15050,4020.173425,2,4.9,3.013440,Sleeping-dog,5,5,2.266986

# 2.데이터 합치기

### 1-1. 추가 속성값을 추가하는 경우

In [70]:
# how to?
# 데이터 조인 : pd.merge(데이터프레임명1, 데이터프레임명2, left_on = '데이터프레임1 조인키', \
#               right_on = '데이터프레임2 조인키',how = "left")
# ※ how 파라미터 기본 값은 inner

### 실습문제 8

#### 8-1. KOPO_REGION_MST, KOPO_CHANNEL_SEASONALITY_NEW 두개의 데이터를 regionMasterData, selectExample 변수에 담으시오

In [71]:
regionMasterData = pd.read_csv("../dataset/kopo_region_mst.csv")

In [72]:
selectedExample = pd.read_csv("../dataset/kopo_channel_seasonality_new.csv")

#### 8-2. refineSelloutData와 groupData를 [REGIONID, PRODUCT, YEAR] 키로 조인하여 mergedData 변수에 담으시오

In [73]:
refineSelloutData.head()

  REGIONID    PRODUCT YEARWEEK      QTY  QTY_NEW  YEAR WEEK
0      A60   PRODUCT4   201402     71.0     71.0  2014   02
1      A60  PRODUCT59   201402  22275.0  22275.0  2014   02
2      A60  PRODUCT34   201402   4463.0   4463.0  2014   02
3      A60  PRODUCT47   201402      0.0      0.0  2014   02
4      A60  PRODUCT56   201402     23.0     23.0  2014   02

In [74]:
groupData["YEAR"] = selloutData.YEAR
groupData.head()

  REGIONID    PRODUCT       QTY_MEAN        QTY_STD  YEAR
0      A00  PRODUCT34     132.445860     154.867743  2014
1      A00  PRODUCT58     105.235669     273.435108  2014
2      A00  PRODUCT59   36086.547771   15192.174914  2014
3      A01   PRODUCT1    5716.726115    3704.948589  2014
4      A01  PRODUCT12  197052.777070  198866.717131  2014

In [75]:
joinKey = ["REGIONID","PRODUCT","YEAR"]

In [76]:
mergedData = pd.merge(refineSelloutData,groupData, left_on=joinKey, right_on=joinKey)\
[["REGIONID","PRODUCT","YEARWEEK","YEAR","WEEK","QTY_NEW","QTY_MEAN"]]

In [77]:
mergedData.head()

  REGIONID   PRODUCT YEARWEEK  YEAR WEEK  QTY_NEW  QTY_MEAN
0      A60  PRODUCT4   201402  2014   02     71.0  44.66242
1      A60  PRODUCT4   201401  2014   01     16.0  44.66242
2      A60  PRODUCT4   201403  2014   03     51.0  44.66242
3      A60  PRODUCT4   201406  2014   06     19.0  44.66242
4      A60  PRODUCT4   201404  2014   04     21.0  44.66242